Tekla.Structures.Model.ISharingResult
Represents the result of a sharing operation, including the result code.

Tekla.Structures.Model.ISharingResult.Code
Gets the result code of the sharing operation.

Tekla.Structures.Model.ISharingResult.ErrorDetails
Gets the error details of the sharing operation.

Tekla.Structures.Model.ISharingResult.State
Gets the state Structures process and current model after the sharing operations completes.

Tekla.Structures.Model.ISharingResult.Notifications
Gets the notifications related to the sharing operation.

Tekla.Structures.Model.ISharingResult.ErrorPath
Gets a path of the file or folder which is relevant to a specific error. Tekla.Structures.Model.SharingResultCode values documentation for a specific cases.

Tekla.Structures.Model.ISharingResult.PathLengthLimit
Gets the maximum allowed length for the path which was exceeded.